//                   Задачка 1                  //
// const userAnswer = prompt("Яка офіційна назва JavaScript?");
// console.log(userAnswer);
//Щоб показувало, що ми вводимо, то треба задати змінну, яка буде дорівнювати promt ("якийсь меседж")
//і тоді вивести це в консоль за допомогою console.log(назва змінної);

// if (userAnswer === "ECMAScript") {
//   alert("Правильно!");
// } else {
//   alert("Не знаєте? ECMAScript!");
// }

//Якщо тіло умови складається з одного рядка, то можна його в увадратні дужки не брати!
// if (userAnswer === "ECMAScript") alert("Правильно!");
// else alert("Не знаєте? ECMAScript!");

//Перероблюємо те саме під !!!!!ТЕРНАРНИЙ ОПЕРАТОР!!!!!!
//умова ? тіло_1,(якщо умова === true) : тіло_2, (якщо умова_1===false)    !!! тільки щоб замінити IF ELSE,
//і тільки, якщо тіло складається з однієї лінійки

// userAnswer === "ECMAScript"
//   ? alert("Правильно!")
//     : alert("Не знаєте? ECMAScript!");

//Ще один спосіб через введення змінної msg
// let msg = "";
// userAnswer === "ECMAScript"
//   ? (msg = "Правильно!")
//   : (msg = "Не знаєте? ECMAScript!");

// alert(msg);

// Можна ще й так
// let msg = userAnswer === "ECMAScript" ? "Правильно!" : "Не знаєте? ECMAScript!";
// alert(msg);

//!---------------------------------------------------------------------------------------------------------!//
//                   Задачка 2   РОЗГАЛУЖЕННЯ               //
// const hours = 14;
// const minutes = 26;
// let timeStr = "";

// if (minutes === 0) timeStr = `${hours} г. `;
// else timeStr = `${hours} г. ${minutes} хв.`;
// console.log(timeStr);

//Перероблюємо те саме під !!!!!ТЕРНАРНИЙ ОПЕРАТОР!!!!!!
const hours = 14;
const minutes = 26;
let timeStr = minutes === 0 ? `${hours} г.` : `${hours} г. ${minutes} хв.`;
console.log(timeStr);

//!---------------------------------------------------------------------------------------------------------!//
//                   Задачка 3     ВКЛАДЕНІ РОЗГАЛУЖЕННЯ             //
a = 120;
b = 1;
if (a > 100 && b > 100) {
  if (a > b) console.log(a);
  else b; //можна так записати тернарним оператором: a > b ? console.log(a) : console.log(b);
} else {
  console.log(b + 512);
}

//а замість цієї перевірки можна використати
console.log(Math.max(a, b));

//Те саме повністю через тернарний (тернарний всередині тернарного): //! НЕ ЧИТАЄТЬСЯ АДЕКВАТНО, ТАКЕ КРАЩЕ НЕ РОБИТИ!//
let result = a > 100 && b > 100 ? (a > b ? a : b) : b + 512;
console.log(result);

//!---------------------------------------------------------------------------------------------------------!//
//                   Задачка 4     SWITCH            //
const daysUntilDeadline = 5;

if (daysUntilDeadline === 0) {
  console.log("Сьогодні");
} else if (daysUntilDeadline === 1) {
  console.log("Завтра");
} else if (daysUntilDeadline === 2) {
  console.log("Післяавтра");
} else {
  console.log("Дата у майбутньому");
}

//РОБИМО РЕФАКТОРІНГ ВИКОРИСТОВУЮЧИ SWITCH
switch (daysUntilDeadline) {
  case 0: {
    console.log("Сьогодні");
    break;
  }
  case 1: {
    console.log("Завтра");
    break;
  }
  case 2: {
    console.log("Післяавтра");
    break;
  }
  default: {
    console.log("Дата у майбутньому");
  }
}

//!---------------------------------------------------------------------------------------------------------!//
//                   Задачка 5     ЦИКЛ for           //
// Напиши цикл for, який виводить у консоль браузера числа за зростанням від
// min до max, але твльки якщо число кратне 5.

//ПРИКЛАД І ПОЯСНЕННЯ ЦИКЛУ FOR

// for (let i = 0; i < 10; i += 1) {
//   console.log(i);
// }

//let i = 0;- це початкова ітерація, значення від якого ми будемо рухатись
//i < 10; - умова, до якої цей цикл буде виконуватись, поки цей вираз істинний, то цикл продовжується
//i += 1; - step, після нього крапку з комою вже не ставимо
//Якщо тіло умови складається з одної строки, то квадоатні дужки для нього можна і не ставити, але якщо більше, то треба.

const max = 100;
const min = 20;

// for (let i = min; i <= 100; i += 5) {
//   console.log(i);
// }

//Якщо початкова ітерація кратна 5, то все ок, а якщо ні, то треба по - іншому з перевіркою всередині:

// for (let i = min; i <= 100; i += 1) {
//   if (i % 5 === 0) console.log(i);
// }
//if (i % 5 === 0) -----якщо при діленні i на 5 останок ділення рівний 0
//% -топератор ділення числа без остачі

//В такій задачі можна рухатись і навпаки від максимального до мвнвмального:
// for (let i = max; i >= min; i -= 1) {
//   if (i % 5 === 0) console.log(i);
// }

//Якщо треба вивести суму всіх i-чисел в консоль:
// let total = 0; //Чому 0- бо до нього будемо додавати і воно не впливатиме на результат

// for (let i = min; i <= 100; i += 1) {
//   if (i % 5 === 0) console.log((total += i));
// }

//ОПЕРАТОР CONTINUE //
// for (let i = min; i <= 100; i += 1) {
//   if (i % 5 !== 0) continue;
//   console.log(i);
// }

//Пояснення continue: Якщо і-тий елемент не ділиться на ціло на 5, то пропускаємо -воно зупиняється на continue,
//не доходить до логування, аж поки умова не виконається і continue не спрацює, відповідно тоді в нас вперше (або знову через 5) залогується

//!---------------------------------------------------------------------------------------------------------!//
//                   Задачка 6     на prompt  Введення користувача та розгалуження         //

//Напиши скрипт, який питатиме логін та за допомогою prompt логувати результат у консоль браузера.

//Якщо відвідувач вводить "Адмін", то prompt запитує пароль
//Якщо нічого не введено, або натиснуто клавішу Esc - вивести рядок "Скасовано"
//В іншому випадку вивести рядок "Я вас не знаю"
//Пароль перевіряти так:

//Якщо введено пароль "Я адмін", то вивести рядок "Здрастуйте!"
//Інакше виводити рядок "Невірний пароль"

const login = prompt("Введіть Логін: ")?.trim();
console.log(login);

if (login === "Адмін") {
  const password = prompt("Введіть пароль: ");

  if (password === "Я адмін") {
    console.log("Здрастуйте!");
  } else {
    console.log("Невірний пароль");
  }
} else if (!login) {
  //замість цього: (login === "" || login === undefined) можна написати так (!login) і результат буде таким самим
  //  в (!login) ! - це логічне "ні"    ! змінює булевий тип елемента на зворотній
  console.log("Скасовано");
} else {
  console.log("Я вас не знаю");
}
//                                                         TRIM
//ЯК ВИДАЛИТИ ЗАЙВІ ПРОБІЛИ В ПУСТІЙ СТРОЦІ, ЩОБ ВОНО НЕ ПОКАЗУВАЛО ЯК ЩОСЬ ВВЕДЕНО НЕПРАВИЛЬНО, А ПОКАЗУВАЛО ЯК НІЧОГО НЕ БУЛО ВВЕДЕНО
//     .trim() одразу після того, що користувач введе в prompt:    const login = prompt("Введіть Логін: ").trim();

//!---------------------------------------------------------------------------------------------------------!//
// ! подивитись додатково !!!!!!!!!!!!!!!
//  Оператор ? і !
// Як працюють постфіксні і префіксні інкременти y ++ замість y +=
